use chrono::NaiveDate;

pub const TEXT_01: &str = "予感日記のエントリー：2024年3月27日、水曜日
今日はまるで春の息吹が感じられるような、穏やかで心地よい一日だった。朝、目を覚ましたときから、空に浮かぶ柔らかい雲と、窓から差し込む温かな光が、新しい日の始まりを告げていた。
朝食はシンプルにトーストとコーヒー。しかし、このルーティンがいつも以上に心地よく感じられた。もしかすると、季節の変わり目のこの時期だからかもしれない。それとも、ただ単に外の景色が美しかったからか。どちらにせよ、日々の小さな瞬間がこんなにも価値あるものに思えるなんて、不思議な感覚だ。
午前中は仕事に集中した。今週中に仕上げなければならないプロジェクトがあって、その準備に追われている。でも、不思議とストレスは感じなかった。むしろ、タスクに没頭することで心が落ち着き、時間が経つのを忘れるほどだった。昼休みには、近くの公園まで散歩に出かけた。花が咲き始め、木々も新しい葉をつけ始めている。この公園の散歩は、いつも心をリフレッシュさせてくれる。
午後には、友人から突然の連絡があった。久しぶりに会いたいと言うので、仕事の後、近くのカフェで待ち合わせした。彼とは大学時代からの友人で、いつもお互いの近況を語り合うのが楽しみの一つだ。彼は最近、新しい趣味に夢中になっていて、その話を熱心にしていた。友人の情熱を聞くのは、いつも刺激的だ。
帰宅後は、軽く夕食をとりながら、一日を振り返った。今日一日は、平穏で、しかし充実したものだった。日々の生活の中で、このような日があることに感謝したい。時には何か大きな出来事がなくとも、小さな幸せが積み重なって、豊かな一日になる。今日のような日を大切にしたい。
そして、今夜は早めにベッドに入るつもりだ。読みかけの本があるから、少しだけ読んでから眠ることにする。外はすっかり静まり返り、時折聞こえる風の音が、心地よい眠りに誘ってくれそうだ。
今日一日を通して感じたことは、平凡な日常の中にも、小さな発見や幸せが隠れているということ。これを大切にして、明日もまた、心穏やかに過ごしていきたい。そして、この日記を書くことで、日々の生活をより深く味わい、感謝の気持ちを忘れないようにしたい。";

pub const TEXT_02: &str  = "日日付：2024年3月26日
今日は、春の訪れを感じる爽やかな一日だった。朝から気持ちの良い陽気で、窓を開けると心地良い風が部屋の中を通り抜けていく。こんな日は、外に出て何か新しいことを始めたくなる。そう思い立ち、朝食後には早速近くの公園へ散歩に出かけた。公園に着くと、桜の木の下でピクニックを楽しむ家族や友人たちの姿が目に入る。彼らの笑顔が、春の暖かさとともに心を満たしてくれる。
昼過ぎまで公園で過ごし、帰宅後は久しぶりに読書に没頭した。手に取ったのは、最近話題の新刊小説。物語に引き込まれるうちに、時間が経つのを忘れてしまった。読書の後は、簡単なランチを済ませ、午後は趣味の絵画に時間をさくことに。キャンバスに春の景色を描きながら、改めて季節の移り変わりの美しさを感じることができた。
夕方、少し疲れを感じ始めた頃、友人からの突然の連絡が。久しぶりに近くのカフェでお茶をしようという誘いだった。久々の再会に心が躍る。カフェでは、互いの近況を語り合い、笑い声が絶えなかった。友人との会話は心を軽くし、日頃のストレスから解放されるような気分になる。
帰宅後は、夕食を作りながら一日を振り返る。今日一日は、新しい季節の訪れを存分に楽しんだ。外出してみると、いつもと違う景色が目に飛び込んでくる。日常生活に新鮮さを与えてくれるのが、春の素晴らしいところだ。今日のような日は、心も体もリフレッシュされる。
夜はゆっくりと過ごし、明日への活力を蓄える。この季節ならではの温かい気候を楽しみながら、これからも日々を大切に過ごしていきたい。明日も、何か小さな発見があるかもしれない。そんな期待を胸に、今日は早めに休むことにする。
日記を閉じながら、今日一日に感謝する。そして、新たな明日が待っていることにワクワクする。こんな穏やかな日々が、いつまでも続いてほしいと心から願う。";

pub const TEXT_03: &str  = "日付：2024年3月26日
今日は朝か、春とは名ばかりの冷たい風が吹き荒れる孤独な一日だった。窓から漏れる光は薄暗く、外の世界に出る気力すら湧かない。朝からずっと、この季節特有の感傷に囚われている。春の訪れが多くの人に希望を与える一方で、私にはただの季節の変わり目以上の意味を持たない。
午前中は、自室の中で過ごした。ほこりが舞う中、本棚から手に取った古い小説を読む。物語の中の登場人物たちも、私と同じように孤独と戦っているように思える。彼らの苦悩が、この曇天の下でより一層鮮明に感じられる。読書を終えると、何となく作り置きの昼食を済ませた。
午後は、ふとした衝動に駆られて、絵を描き始める。しかし、キャンバスには春の明るさなど描けず、代わりに深い闇と孤独感が滲み出る。筆を置くと、描かれた絵からは何の慰めも得られない。それどころか、絵は私の内面の荒廃を余すところなく映し出しているようだ。
夕方になり、携帯が鳴る。画面に映ったのは、久しぶりに連絡を取った友人からのメッセージ。しかし、今の私にはその誘いに応える余裕もなく、メッセージを無視する。友人との交流がかつては心の支えだったが、今はただの過去の遺物のように思える。
夜、ひとりで静かに夕食を取りながら、今日一日を振り返る。春の訪れが人々に活力を与えるというが、私にはその暖かさが届かない。外の世界は生き生きとしているかもしれないが、私の心は冬の名残に閉ざされたままだ。
部屋に戻り、ベッドに横たわる。春の夜長をどう過ごすか考えながら、結局は何もする気になれず、ただ天井を見つめる。この季節がもたらす新たな生命の息吹を感じることができない自分に、深い絶望を覚える。
孤独な一日が終わり、また新たな孤独が始まる。春の訪れを前にしても、私の心は変わらず冷たい冬に閉じ込められている。希望を見出すことができず、ただ時が過ぎるのを待つだけ。この循環から抜け出すことはできるのだろうか。
日記を閉じるとき、ふと心に浮かんだのは、明日もまた同じような一日になるだろうという予感だった。この繰り返しの中で、少しでも光を見つけることができればと願うが、それは遠い夢のようだ。";

#[derive(Clone)]
pub struct Excel {
    pub path: String,
    pub path_id: i32,
    pub sheets: Vec<ExcelSheet>,
}

#[derive(Clone)]
pub struct ExcelSheet {
    pub sheet_name: String,
    pub sheet_text: String,
}

pub fn get_dummy_date() -> Vec<Excel> {
    let mut excel = Vec::new();
    let sheet1 = ExcelSheet {
        sheet_name: "Sheet1".to_string(),
        sheet_text: TEXT_01.to_string(),
    };
    let sheet2 = ExcelSheet {
        sheet_name: "Sheet2".to_string(),
        sheet_text: TEXT_02.to_string(),
    };
    let sheet3 = ExcelSheet {
        sheet_name: "Sheet3".to_string(),
        sheet_text: TEXT_03.to_string(),
    };
    let excel1 = Excel {
        path: "path1".to_string(),
        path_id: 1,
        sheets: vec![sheet1.clone(), sheet2.clone(), sheet3.clone()],
    };
    let excel2 = Excel {
        path: "path2".to_string(),
        path_id: 2,
        sheets: vec![sheet1.clone(), sheet2.clone(), sheet3.clone()],
    };
    let excel3 = Excel {
        path: "path3".to_string(),
        path_id: 3,
        sheets: vec![sheet1.clone(), sheet2.clone(), sheet3.clone()],
    };
    excel.push(excel1);
    excel.push(excel2);
    excel.push(excel3);
    excel
}
